
##########
# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors:
  - [19,14, 32,42, 190,16]  # P3/8
  - [59,57, 45,105, 408,15]  # P4/16
  - [65,155, 117,161, 252,153]  # P5/32

## YOLOv5 v6.0 backbone
#backbone:
#  # [from, number, module, args]
#  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
#   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
#   [-1, 3, C3, [128]],
#   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
#   [-1, 6, C3, [256]],
#   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
#   [-1, 9, C3, [512]],
#   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
#   [-1, 3, C3, [1024]],
#   [-1, 1, SPPF, [1024, 5]],  # 9
#  ]
#
## YOLOv5 v6.0 head
#head:
#  [[-1, 1, Conv, [512, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
#   [-1, 3, C3, [512, False]],  # 13
#
#   [-1, 1, Conv, [256, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
#   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)
#
#   [-1, 1, Conv, [256, 3, 2]],
#   [[-1, 14], 1, Concat, [1]],  # cat head P4
#   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)
#
#   [-1, 1, Conv, [512, 3, 2]],
#   [[-1, 10], 1, Concat, [1]],  # cat head P5
#   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)
#
#   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
#  ]
#backbone shuffle
#backbone:
#  # [from, number, module, args]
#  [[-1, 1, CBRM, [32]],  # 0-P1/4
#   [-1, 1, Shuffle_Block, [128, 2]],  # 1-P2/8
#   [-1, 3, Shuffle_Block, [128, 1]],
#   [-1, 1, Shuffle_Block, [256, 2]],  # 3-P3/16
#   [-1, 7, Shuffle_Block, [256, 1]],
#   [-1, 1, Shuffle_Block, [512, 2]],  # 5-P4/32
#   [-1, 3, Shuffle_Block, [512, 1]],
#  ]
#
## YOLOv5 v6.0 head
#head:
#  [[-1, 1, Conv, [256, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
#   [-1, 1, C2f, [256, False]],  # 10
#
#   [-1, 1, Conv, [128, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
#   [-1, 1, C2f, [128, False]],  # 14 (P3/8-small)
#
#   [-1, 1, Conv, [128, 3, 2]],
#   [[-1, 11], 1, Concat, [1]],  # cat head P4
#   [-1, 1, C2f, [256, False]],  # 17 (P4/16-medium)
#
#   [-1, 1, Conv, [256, 3, 2]],
#   [[-1, 7], 1, Concat, [1]],  # cat head P5
#   [-1, 1, C2f, [512, False]],  # 20 (P5/32-large)
#
#   [[14, 17, 20], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
#  ]

##backbone shuffle SE
#backbone:
#  # [from, number, module, args]
#  [[-1, 1, CBRM, [32]],  # 0-P1/4
#   [-1, 1, Shuffle_Block, [128, 2]],  # 1-P2/8
#   [-1, 3, Shuffle_Block, [128, 1]],
#   [-1, 1, Shuffle_Block, [256, 2]],  # 3-P3/16
#   [-1, 7, Shuffle_Block, [256, 1]],
#   [-1, 1, Shuffle_Block, [512, 2]],  # 5-P4/32
#   [-1, 3, Shuffle_Block, [512, 1]],
#  ]
#
## YOLOv5 v6.0 head
#head:
#  [[-1, 1, Conv, [256, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
#   [-1, 1, CoordAtt, [512]],
#   [-1, 1, C2f, [256, False]],  # 10
#
#   [-1, 1, Conv, [128, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
#   [-1, 1, CoordAtt, [256]],
#   [-1, 1, C2f, [128, False]],  # 14 (P3/8-small)
#
#   [-1, 1, Conv, [128, 3, 2]],
#   [[-1, 12], 1, Concat, [1]],  # cat head P4
#   [-1, 1, CoordAtt, [256]],
#   [-1, 1, C2f, [256, False]],  # 17 (P4/16-medium)
#
#   [-1, 1, Conv, [256, 3, 2]],
#   [[-1, 7], 1, Concat, [1]],  # cat head P5
#   [-1, 1, CoordAtt, [512]],
#   [-1, 1, C2f, [512, False]],  # 20 (P5/32-large)
#
#   [[16, 20, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
#  ]


# Swin-Transformer-Tiny backbone
backbone:
  # [from, number, module, args]
  # input [b, 1, 640, 640]
  [[-1, 1, PatchEmbed, [96, 4]],  # 0 [b, 96, 160, 160]
   [-1, 1, SwinStage, [96, 2, 3, 7]],  # 1 [b, 96, 160, 160]
   [-1, 1, PatchMerging, [192]],    # 2 [b, 192, 80, 80]
   [-1, 1, SwinStage, [192, 2, 6, 7]],  # 3 --F0-- [b, 192, 80, 80]
   [ -1, 1, PatchMerging, [384]],   # 4 [b, 384, 40, 40]
   [ -1, 1, SwinStage, [384, 6, 12, 7]], # 5 --F1-- [b, 384, 40, 40]
   [ -1, 1, PatchMerging, [768]],   # 6 [b, 768, 20, 20]
   [ -1, 1, SwinStage, [768, 2, 24, 7]], # 7 --F2-- [b, 768, 20, 20]
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 11

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 15 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 18 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 8], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 21 (P5/32-large)

   [[15, 18, 21], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]